[
    "Super Easy Analytics started out as a meme addon as a response to a YouTube comment.",
    "Pidgon Tools was founded in Summer 2016. Blender 2.77 was the latest release at that time.",
    "Almost all Pidgeon Tools Addons were created as a response to an already existing addon.",
    "This page isn't the only easteregg on this website.",
    "Donations are very appreciated, but if someone else told you, that our addons (Name starting with 'Super ...') aren't free, they lied.",
    "Do you confuse '$0' and 'Free'? Apparently, some people tend to only look at the dollar sign and ignore the number behind it. Fortunately, you're lucky: All Pidgeon Tools addons that start with 'Super ...' are 100% free.",
    "Pidgeons are very social animals.",
    "Because feeding pidgeons with breadcrumbs is not species-appropriate, it is forbidden in Germany and some other countries and can cost up to 5000€ penalty (Germany).",
    "Even though pidgeons all look the same at first glance, the shape and color of the eyes, for example, are different for each individual pidgeon.",
    "City pidgeons are descendants of pidgeons bred by humans as pets and domestic animals.",
    "Managed pidgeon houses solve several problems caused by urban pidgeons at once: The pidgeons are fed in a species-appropriate manner and reproduction can be specifically controlled by replacing pidgeon eggs with attraps.",
    "Because pidgeons are loyal and reliable, they were bred by the ancient Romans and Greeks nearly 2,800 years ago.",
    "Pidgeons are very intelligent animals: In an intelligence test, they were able to recognize certain objects in a room faster than the smartest human!",
    "Pidgeons can remember up to 725 different patterns and can even distinguish between artworks by different artists.",
    "Since pidgeons have a magnetic sense and feel the earth's magnetic field, they can orient themselves by it and thus always find their way.",
    "Despite their bad reputation, pidgeons represent peace, love, loyalty and motherhood."
]